In [1]:
import numpy as np
import pandas as pd
import datetime

 ## DataFrames

In [2]:
students = ['Alice', 'Bob', 'Emily', 'Charlie']

In [3]:
scores = [90, 80, 65, 50]

In [4]:
exam_results = pd.DataFrame(
    {
        "name": students,
        "scores": scores
    }
)

In [5]:
exam_results

      name  scores
0    Alice      90
1      Bob      80
2    Emily      65
3  Charlie      50

### Searching (SQL SELECT)

In [6]:
exam_results.loc[0, 'scores']

90

In [7]:
exam_results.loc[:, 'scores']

0    90
1    80
2    65
3    50
Name: scores, dtype: int64

In [8]:
exam_results.loc[2, :]

name      Emily
scores       65
Name: 2, dtype: object

In [9]:
exam_results['scores']

0    90
1    80
2    65
3    50
Name: scores, dtype: int64

In [10]:
exam_results[['name', 'scores']]

      name  scores
0    Alice      90
1      Bob      80
2    Emily      65
3  Charlie      50

### Add Columns

We can also easily add columns

In [11]:
gender = ['female', 'male', 'female', 'male']

In [12]:
exam_results['gender'] = gender

In [13]:
exam_results

      name  scores  gender
0    Alice      90  female
1      Bob      80    male
2    Emily      65  female
3  Charlie      50    male

In [14]:
exam_results['scores']

0    90
1    80
2    65
3    50
Name: scores, dtype: int64

### Remove Columns

In [15]:
exam_results.drop('name', axis=1)

   scores  gender
0      90  female
1      80    male
2      65  female
3      50    male

In [16]:
exam_results.columns

Index(['name', 'scores', 'gender'], dtype='object')

In [17]:
exam_results.index

RangeIndex(start=0, stop=4, step=1)

### Renaming Columns

In [18]:
exam_results.rename({'name': 'first_name'}, axis=1)

  first_name  scores  gender
0      Alice      90  female
1        Bob      80    male
2      Emily      65  female
3    Charlie      50    male

### Dealing with missing values

Dataframes have specific commands which help with the handling of missing data

In [19]:
sparse = pd.DataFrame({'a': [1, 2, 3],
                       'b': [np.nan, 4, np.nan],
                       'c': [5, np.nan, np.nan]})

In [20]:
sparse

   a    b    c
0  1  NaN  5.0
1  2  4.0  NaN
2  3  NaN  NaN

In [21]:
sparse.isna()

       a      b      c
0  False   True  False
1  False  False   True
2  False   True   True

In [22]:
sparse.fillna(0)

   a    b    c
0  1  0.0  5.0
1  2  4.0  0.0
2  3  0.0  0.0

sparse.dropna(axis=1)

### Group by

In [23]:
exam_results.groupby('gender').mean()

        scores
gender
female    77.5
male      65.0

In [25]:
mylist = [1,2,1,2]

exam_results.groupby(mylist).get_group

In [26]:
exam_results.groupby(mylist).get_group(2)

      name  scores gender
1      Bob      80   male
3  Charlie      50   male

Thus, suppose we want to group people who obtained marks above or below 70, then we could do:

In [28]:
above_70 = exam_results['scores'] > 70
above_70

0     True
1     True
2    False
3    False
Name: scores, dtype: bool

In [29]:
This will compute the mean scores of students who scored above or below 70

SyntaxError: invalid syntax (3375888667.py, line 1)

In [30]:
exam_results.groupby(above_70).mean()

        scores
scores
False     57.5
True      85.0

### Merge and Joining

In [32]:
contacts = pd.DataFrame(
    {
        'name' : ['Alice', 'Charlie'],
        'tel'  : ['+44 1234 5678', '+44 3245 5564']
    }
)

In [33]:
exam_results.merge(contacts, left_on='name', right_on='name')   # defaults to inner join

      name  scores  gender            tel
0    Alice      90  female  +44 1234 5678
1  Charlie      50    male  +44 3245 5564

In [34]:
exam_results.merge(contacts, left_on='name', right_on='name', how='outer')

      name  scores  gender            tel
0    Alice      90  female  +44 1234 5678
1      Bob      80    male            NaN
2    Emily      65  female            NaN
3  Charlie      50    male  +44 3245 5564